{
  "report": [
    {
      "name": "lvl0_profiled_time",
      "status": "bad",
      "score": 0,
      "max_score": 4,
      "text": "Application profile is too short (0.13 s)",
      "desc": "If the overall application profiling time is less than 10 seconds, many of the measurements at function or loop level will very likely be under the measurement quality threshold (0,1 seconds).\n Rerun to increase runtime duration: for example use a larger dataset or include a repetition loop."
    },
    {
      "name": "lvl0_optimization_level",
      "status": "bad",
      "score": 0,
      "max_score": 3,
      "text": "Some functions are compiled with a low optimization level (O0 or O1)",
      "desc": "To have better performances, it is advised to help the compiler by using a proper optimization level (-O2 of higher). Warning, depending on compilers, faster optimization levels can decrease numeric accuracy."
    },
    {
      "name": "lvl0_utilitary_options",
      "status": "bad",
      "score": 0,
      "max_score": 3,
      "text": "Most of time spent in analyzed modules comes from functions without compilation information",
      "desc": "Functions without compilation information (typically not compiled with -g and -grecord-gcc-switches) cumulate 100.00% of the time spent in analyzed modules. Check that -g and -grecord-gcc-switches are present.\nRemark: if -g and -grecord-gcc-switches are indeed used, this can also be due to some compiler built-in functions (typically math) or statically linked libraries. This warning can be ignored in that case."
    },
    {
      "name": "lvl0_architecture_options",
      "status": "bad",
      "score": 0,
      "max_score": 3,
      "text": "Compilation of some functions is not optimized for the target processor",
      "desc": "Architecture specific options are needed to produce efficient code for a specific processor ( -x(target) or -ax(target) )."
    },
    {
      "name": "lvl0_profiled_modules",
      "status": "good",
      "score": 2,
      "max_score": 2,
      "text": "Application is correctly profiled (\"Others\" category represents 3.85 % of the execution time)",
      "desc": "To have a representative profiling, it is advised that the category \"Others\" represents less than 20% of the execution time in order to analyze as much as possible of the user code"
    },
    {
      "name": "lvl0_is_fastmath",
      "status": "warning",
      "score": 0,
      "max_score": 0,
      "text": "Fastmath not used",
      "desc": "Consider to add ffast-math to compilation flags (or replace -O3 with -Ofast) to unlock potential extra speedup by relaxing floating-point computation consistency. Warning: floating-point accuracy may be reduced and the compliance to IEEE/ISO rules/specifications for math functions will be relaxed, typically 'errno' will no longer be set after calling some math functions."
    }
  ]
}
