{
  "report": [
    {
      "name": "lvl0_profiled_time",
      "status": "good",
      "score": 4,
      "max_score": 4,
      "text": "Application profile is long enough (13.40 s)",
      "desc": "To have good quality measurements, it is advised that the application profiling time is greater than 10 seconds."
    },
    {
      "name": "lvl0_optimization_level",
      "status": "good",
      "score": 3,
      "max_score": 3,
      "text": "Optimization level option is correctly used",
      "desc": ""
    },
    {
      "name": "lvl0_utilitary_options",
      "status": "warning",
      "score": 2.4,
      "max_score": 3,
      "text": "Most of time spent in analyzed modules comes from functions without compilation information",
      "desc": "Functions without compilation information (typically not compiled with -g) cumulate 0.00% of the time spent in analyzed modules. Check that -g is present.\nRemark: if -g is indeed used, this can also be due to some compiler built-in functions (typically math) or statically linked libraries. This warning can be ignored in that case."
    },
    {
      "name": "lvl0_architecture_options",
      "status": "good",
      "score": 3,
      "max_score": 3,
      "text": "Architecture specific option -march=haswell is used",
      "desc": ""
    },
    {
      "name": "lvl0_profiled_modules",
      "status": "good",
      "score": 2,
      "max_score": 2,
      "text": "Application is correctly profiled (\"Others\" category represents 0.30 % of the execution time)",
      "desc": "To have a representative profiling, it is advised that the category \"Others\" represents less than 20% of the execution time in order to analyze as much as possible of the user code"
    },
    {
      "name": "lvl0_is_fastmath",
      "status": "warning",
      "score": 0,
      "max_score": 0,
      "text": "Fastmath not used",
      "desc": "Consider to add ffast-math to compilation flags (or replace -O3 with -Ofast) to unlock potential extra speedup by relaxing floating-point computation consistency. Warning: floating-point accuracy may be reduced and the compliance to IEEE/ISO rules/specifications for math functions will be relaxed, typically 'errno' will no longer be set after calling some math functions."
    }
  ]
}
